ingestion-environment/scripts/jmeter-load-testing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Broker Parameters">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BrokerHost" elementType="Argument">
            <stringProp name="Argument.name">BrokerHost</stringProp>
            <stringProp name="Argument.value">172.104.10.78</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">localhost</stringProp>
          </elementProp>
          <elementProp name="BrokerPort" elementType="Argument">
            <stringProp name="Argument.name">BrokerPort</stringProp>
            <stringProp name="Argument.value">31883</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">1883</stringProp>
          </elementProp>
          <elementProp name="Topic" elementType="Argument">
            <stringProp name="Argument.name">Topic</stringProp>
            <stringProp name="Argument.value">ingestion/telemetry</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="QoS" elementType="Argument">
            <stringProp name="Argument.name">QoS</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TlsEnabled" elementType="Argument">
            <stringProp name="Argument.name">TlsEnabled</stringProp>
            <stringProp name="Argument.value">0</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Scenario Parameters">
        <collectionProp name="Arguments.arguments">
          <elementProp name="NumberHomes" elementType="Argument">
            <stringProp name="Argument.name">NumberHomes</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NumberMessages" elementType="Argument">
            <stringProp name="Argument.name">NumberMessages</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DelayPerMessageMs" elementType="Argument">
            <stringProp name="Argument.name">DelayPerMessageMs</stringProp>
            <stringProp name="Argument.value">1000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Infrastructure Parameters">
        <collectionProp name="Arguments.arguments">
          <elementProp name="RampUpTimeSec" elementType="Argument">
            <stringProp name="Argument.name">RampUpTimeSec</stringProp>
            <stringProp name="Argument.value">30</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SAMPLES_DIR" elementType="Argument">
            <stringProp name="Argument.name">SAMPLES_DIR</stringProp>
            <stringProp name="Argument.value">/home/lucasmotta/Desktop/cloud-architecture-validation/ingestion-environment/samples</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PREPROCESSOR_DIR" elementType="Argument">
            <stringProp name="Argument.name">PREPROCESSOR_DIR</stringProp>
            <stringProp name="Argument.value">/home/lucasmotta/Desktop/cloud-architecture-validation/ingestion-environment/scripts</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group (Publishers)" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${NumberHomes}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RampUpTimeSec}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">HOME_NUMBER</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
        <OnceOnlyController guiclass="OnceOnlyControllerGui" testclass="OnceOnlyController" testname="Once Only Controller" enabled="true"/>
        <hashTree>
          <net.xmeter.samplers.ConnectSampler guiclass="net.xmeter.gui.ConnectSamplerUI" testclass="net.xmeter.samplers.ConnectSampler" testname="MQTT Connect - Publisher" enabled="false">
            <stringProp name="mqtt.server">${BrokerHost}</stringProp>
            <stringProp name="mqtt.port">${BrokerPort}</stringProp>
            <stringProp name="mqtt.version">3.1.1</stringProp>
            <stringProp name="mqtt.conn_timeout">10</stringProp>
            <stringProp name="mqtt.protocol">TCP</stringProp>
            <boolProp name="mqtt.dual_ssl_authentication">false</boolProp>
            <stringProp name="mqtt.user_name">CONTROLLER-${HOME_NUMBER}</stringProp>
            <stringProp name="mqtt.password">minha-senha-forte</stringProp>
            <stringProp name="mqtt.client_id_prefix">CONTROLLER-${HOME_NUMBER}</stringProp>
            <boolProp name="mqtt.client_id_suffix">false</boolProp>
            <stringProp name="mqtt.conn_keep_alive">600</stringProp>
            <stringProp name="mqtt.conn_attampt_max">0</stringProp>
            <stringProp name="mqtt.reconn_attampt_max">0</stringProp>
            <stringProp name="mqtt.conn_clean_session">true</stringProp>
          </net.xmeter.samplers.ConnectSampler>
          <hashTree/>
          <net.xmeter.samplers.ConnectSampler guiclass="net.xmeter.gui.ConnectSamplerUI" testclass="net.xmeter.samplers.ConnectSampler" testname="MQTT Connect - Publisher (Cloud)">
            <stringProp name="mqtt.server">${BrokerHost}</stringProp>
            <stringProp name="mqtt.port">${BrokerPort}</stringProp>
            <stringProp name="mqtt.version">3.1.1</stringProp>
            <stringProp name="mqtt.conn_timeout">600</stringProp>
            <stringProp name="mqtt.protocol">TCP</stringProp>
            <boolProp name="mqtt.dual_ssl_authentication">false</boolProp>
            <stringProp name="mqtt.user_name">CONTROLLER-${HOME_NUMBER}</stringProp>
            <stringProp name="mqtt.client_id_prefix">CONTROLLER-${HOME_NUMBER}</stringProp>
            <boolProp name="mqtt.client_id_suffix">false</boolProp>
            <stringProp name="mqtt.conn_keep_alive">1200</stringProp>
            <stringProp name="mqtt.conn_attampt_max">0</stringProp>
            <stringProp name="mqtt.reconn_attampt_max">0</stringProp>
            <stringProp name="mqtt.conn_clean_session">true</stringProp>
          </net.xmeter.samplers.ConnectSampler>
          <hashTree/>
        </hashTree>
        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Time (Group Threads)">
          <stringProp name="groupSize">${NumberHomes}</stringProp>
          <stringProp name="timeoutInMs">${__jexl3(${RampUpTimeSec} * 1000)}</stringProp>
        </SyncTimer>
        <hashTree/>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <stringProp name="LoopController.loops">${NumberMessages}</stringProp>
        </LoopController>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="filename">${PREPROCESSOR_DIR}/jmeter-preprocessor-script.groovy</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <net.xmeter.samplers.PubSampler guiclass="net.xmeter.gui.PubSamplerUI" testclass="net.xmeter.samplers.PubSampler" testname="MQTT Pub Sampler (Defined Payload)" enabled="true">
            <stringProp name="mqtt.topic_name">${Topic}</stringProp>
            <stringProp name="mqtt.qos_level">${QoS}</stringProp>
            <boolProp name="mqtt.add_timestamp">false</boolProp>
            <stringProp name="mqtt.message_type">String</stringProp>
            <stringProp name="mqtt.message_type_fixed_length">${PayloadSize}</stringProp>
            <stringProp name="mqtt.message_to_sent">${BODY}
</stringProp>
            <boolProp name="mqtt.retained_message">false</boolProp>
          </net.xmeter.samplers.PubSampler>
          <hashTree/>
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer (Delay Per Message Ms)" enabled="true">
            <stringProp name="ConstantTimer.delay">${DelayPerMessageMs}</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>